Revit 2024 API
EnergyDataSettings.BuildingEnvelopeDeterminationMethod Property
 Indicates if an analysis should be perform to find the model elements that are part of the building envelope
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public gbXMLExportBuildingEnvelope BuildingEnvelopeDeterminationMethod { get; set; }
Visual Basic
Public Property BuildingEnvelopeDeterminationMethod As gbXMLExportBuildingEnvelope
	Get
	Set
Visual C++
public:
property gbXMLExportBuildingEnvelope BuildingEnvelopeDeterminationMethod {
	gbXMLExportBuildingEnvelope get ();
	void set (gbXMLExportBuildingEnvelope value);
}
Remarks
 The analysis is performed for the detailed GreenBuildingXML export and in heating and cooling load calculations. This method uses a combination of ray-casting and flood-fill algorithms in order to find the building elements that are exposed to the outside of the building. Analytical surface originated from the building elements in the envelope will be classified as exterior or shading surfaces.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The building envelope determination method does not fall within an appropriate range.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace